## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/49d3ea0b-94f9-440e-a489-004172f758d1/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app.app will be created
  + resource "azurerm_container_app" "app" {
      + container_app_environment_id  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "biotrackr-auth"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-biotrackr-prod-ae"
      + revision_mode                 = "Multiple"
      + tags                          = {
          + "Application" = "biotrackr"
          + "Component"   = "Auth"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 80
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + identity = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae"
          + server   = "acrbiotrackrprodae.azurecr.io"
        }

      + template {
          + max_replicas    = 3
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "mcr.microsoft.com/k8se/quickstart:latest"
              + memory            = "0.5Gi"
              + name              = "biotrackr-auth"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # azurerm_container_app.app will be created%0A  + resource "azurerm_container_app" "app" {%0A      + container_app_environment_id  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae"%0A      + custom_domain_verification_id = (sensitive value)%0A      + id                            = (known after apply)%0A      + latest_revision_fqdn          = (known after apply)%0A      + latest_revision_name          = (known after apply)%0A      + location                      = (known after apply)%0A      + name                          = "biotrackr-auth"%0A      + outbound_ip_addresses         = (known after apply)%0A      + resource_group_name           = "rg-biotrackr-prod-ae"%0A      + revision_mode                 = "Multiple"%0A      + tags                          = {%0A          + "Application" = "biotrackr"%0A          + "Component"   = "Auth"%0A          + "environment" = "Production"%0A          + "owner"       = "willvelida"%0A        }%0A%0A      + identity {%0A          + identity_ids = [%0A              + "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae",%0A            ]%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "UserAssigned"%0A        }%0A%0A      + ingress {%0A          + allow_insecure_connections = false%0A          + external_enabled           = true%0A          + fqdn                       = (known after apply)%0A          + target_port                = 80%0A          + transport                  = "auto"%0A%0A          + custom_domain (known after apply)%0A%0A          + traffic_weight {%0A              + latest_revision = true%0A              + percentage      = 100%0A            }%0A        }%0A%0A      + registry {%0A          + identity = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae"%0A          + server   = "acrbiotrackrprodae.azurecr.io"%0A        }%0A%0A      + template {%0A          + max_replicas    = 3%0A          + min_replicas    = 0%0A          + revision_suffix = (known after apply)%0A%0A          + container {%0A              + cpu               = 0.25%0A              + ephemeral_storage = (known after apply)%0A              + image             = "mcr.microsoft.com/k8se/quickstart:latest"%0A              + memory            = "0.5Gi"%0A              + name              = "biotrackr-auth"%0A            }%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>